arduino/ArduinoCore-zephyr/boards.txt
unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
unoq.menu.wait_linux_boot.app=Wait for App
unoq.menu.wait_linux_boot.app.build.boot_mode=app

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.zephyr_hals=hal_stm32
unoq.build.zephyr_toolchain=arm-zephyr-eabi
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr

unoq.openocd_cfg=flash_sketch.cfg
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##############################################################################################################

nano_connect.name=Arduino Nano RP2040 Connect
nano_connect.build.core=arduino
nano_connect.build.crossprefix=arm-zephyr-eabi-
nano_connect.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano_connect.menu.debug.false=Standard
nano_connect.menu.debug.true=Debug
nano_connect.menu.debug.true.build.zsk_args.debug=-debug

nano_connect.menu.link_mode.dynamic=Dynamic
nano_connect.menu.link_mode.static=Static
nano_connect.menu.link_mode.static.build.link_mode=static
nano_connect.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_connect.build.zephyr_target=arduino_nano_connect
nano_connect.build.zephyr_args=
nano_connect.build.zephyr_hals=hal_rpi_pico
nano_connect.build.zephyr_toolchain=arm-zephyr-eabi
nano_connect.build.artifact=zephyr_main
nano_connect.build.variant=arduino_nano_connect_rp2040

nano_connect.build.extra_flags=
nano_connect.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_connect.recipe.hooks.objcopy.postobjcopy.3.pattern="{runtime.tools.bin2uf2.path}/bin2uf2" {upload.address} {upload.familyid} "{build.path}/{build.project_name}.{upload.extension}" "{build.path}/{build.project_name}.{upload.extension}.uf2"
nano_connect.upload.artifacts.sketch={build.path}/{build.project_name}.{upload.extension}.uf2
nano_connect.build.board=NANO_RP2040_CONNECT
nano_connect.upload_port.0.vid=0x2341
nano_connect.upload_port.0.pid=0x065E

nano_connect.upload.tool=picotool
nano_connect.upload.tool.default=picotool
nano_connect.upload.protocol=
nano_connect.upload.transport=
nano_connect.upload.use_1200bps_touch=true
nano_connect.upload.wait_for_upload_port=false
nano_connect.upload.native_usb=true

nano_connect.upload.familyid=0xe48bff56

nano_connect.bootloader.tool=picotool
nano_connect.bootloader.tool.default=picotool
nano_connect.bootloader.file=zephyr-{build.variant}.uf2

nano_connect.debug.tool=gdb
nano_connect.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano_connect.debug.server.openocd.scripts.1={programmer.transport_script}
nano_connect.debug.server.openocd.scripts.2=target/rp2040-core0.cfg
nano_connect.debug.cortex-debug.custom.request=attach
nano_connect.debug.svd_file={runtime.platform.path}/svd/rp2040.svd

##############################################################################################################

ventunoq.name=Arduino Ventuno Q
ventunoq.build.core=arduino
ventunoq.build.crossprefix=arm-zephyr-eabi-
ventunoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

ventunoq.menu.link_mode.dynamic=Dynamic
ventunoq.menu.link_mode.static=Static
ventunoq.menu.link_mode.static.build.link_mode=static
ventunoq.menu.link_mode.static.upload.extension=bin-zsk.bin

ventunoq.menu.wait_linux_boot.yes=Wait for Linux
ventunoq.menu.wait_linux_boot.no=Immediate
ventunoq.menu.wait_linux_boot.no.build.boot_mode=immediate
ventunoq.menu.wait_linux_boot.app=Wait for App
ventunoq.menu.wait_linux_boot.app.build.boot_mode=app
ventunoq.openocd_cfg=flash_sketch.cfg

ventunoq.build.zephyr_target=arduino_ventuno_q
ventunoq.build.zephyr_args=
ventunoq.build.variant=arduino_ventuno_q_stm32h5f5xx
ventunoq.build.artifact=zephyr_unoq
ventunoq.build.subarch=zephyr
ventunoq.build.mcu=cortex-m33
ventunoq.build.fpu=-mfpu=fpv5-sp-d16
ventunoq.build.architecture=cortex-m33
ventunoq.compiler.zephyr.arch.define=

ventunoq.build.float-abi=-mfloat-abi=hard
ventunoq.build.extra_flags=
ventunoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
ventunoq.build.board=VENTUNO_Q
ventunoq.build.zephyr_hals=hal_stm32
ventunoq.build.extra_flags=
ventunoq.compiler.zephyr=
ventunoq.vid.0=0x2341
ventunoq.pid.0=0x007a
ventunoq.vid.1=0x1209
ventunoq.pid.1=0xca01
ventunoq.upload_port.0.vid=0x2341
ventunoq.upload_port.0.pid=0x007a
ventunoq.upload.address=0x80F0000
ventunoq.upload.target=stm32h5f5xx

ventunoq.upload.tool=remoteocd
ventunoq.upload.tool.default=remoteocd
ventunoq.upload.tool.network=remoteocd_network
ventunoq.upload.protocol=
ventunoq.upload.transport=
ventunoq.upload.vid=0x2341
ventunoq.upload.pid=0x007a
ventunoq.upload.interface=0
ventunoq.upload.use_1200bps_touch=false
ventunoq.upload.wait_for_upload_port=false
ventunoq.upload.native_usb=true
ventunoq.upload.maximum_size=1966080
ventunoq.upload.maximum_data_size=523624

ventunoq.bootloader.tool=remoteocd
ventunoq.bootloader.tool.default=remoteocd
ventunoq.bootloader.file=zephyr-{build.variant}.elf
ventunoq.bootloader.target=stm32h5f5xx

#############################################################

seeed_xiao_nrf54l15.name=Seeed Studio XIAO nRF54L15
seeed_xiao_nrf54l15.build.core=arduino
seeed_xiao_nrf54l15.build.crossprefix=arm-zephyr-eabi-
seeed_xiao_nrf54l15.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/
seeed_xiao_nrf54l15.menu.debug.false=Standard
seeed_xiao_nrf54l15.menu.debug.true=Debug
seeed_xiao_nrf54l15.menu.debug.true.build.zsk_args.debug=-debug
seeed_xiao_nrf54l15.menu.link_mode.dynamic=Dynamic
seeed_xiao_nrf54l15.menu.link_mode.static=Static
seeed_xiao_nrf54l15.menu.link_mode.static.build.link_mode=static
seeed_xiao_nrf54l15.menu.link_mode.static.upload.extension=bin-zsk.bin
seeed_xiao_nrf54l15.build.zephyr_target=xiao_nrf54l15/nrf54l15/cpuapp
seeed_xiao_nrf54l15.build.zephyr_args=
seeed_xiao_nrf54l15.build.zephyr_hals=hal_nordic
seeed_xiao_nrf54l15.build.zephyr_toolchain=arm-zephyr-eabi
seeed_xiao_nrf54l15.build.artifact=zephyr_contrib
seeed_xiao_nrf54l15.build.variant=xiao_nrf54l15_nrf54l15_cpuapp
seeed_xiao_nrf54l15.build.extra_flags=
seeed_xiao_nrf54l15.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
seeed_xiao_nrf54l15.build.board=SEEED_XIAO_NRF54L15
seeed_xiao_nrf54l15.upload_port.0.vid=0x2886
seeed_xiao_nrf54l15.upload_port.0.pid=0x0066
# Upload goes through the onboard SAMD11 CMSIS-DAP probe: the USB-C
# connector is wired to the SAMD11, whose CDC port is both console and
# upload port (VID:PID 2886:0066, constant while the board runs). There
# is no serial-DFU bootloader, so no 1200bps touch and no port swap.
# Uses the pyocd recipe, same arrangement as ek_ra8d1 and the FRDM
# boards: pyOCD is a user-installed tool (pip install pyocd; >= 0.37
# provides the nrf54l target), since the OpenOCD version bundled with
# the core (0.12.0-arduino1-static) predates nRF54L15 support.
seeed_xiao_nrf54l15.upload.tool=pyocd
seeed_xiao_nrf54l15.upload.tool.default=pyocd
seeed_xiao_nrf54l15.upload.protocol=
seeed_xiao_nrf54l15.upload.transport=
seeed_xiao_nrf54l15.upload.use_1200bps_touch=false
seeed_xiao_nrf54l15.upload.wait_for_upload_port=false
seeed_xiao_nrf54l15.upload.native_usb=true
seeed_xiao_nrf54l15.upload.target=nrf54l
seeed_xiao_nrf54l15.upload.offset=0x0 # uploader programs at absolute addresses (sketch partition start 0x60000)
seeed_xiao_nrf54l15.bootloader.tool=pyocd
seeed_xiao_nrf54l15.bootloader.tool.default=pyocd
seeed_xiao_nrf54l15.bootloader.file=zephyr-{build.variant}.elf
seeed_xiao_nrf54l15.bootloader.target=nrf54l
seeed_xiao_nrf54l15.bootloader.address=0x0
seeed_xiao_nrf54l15.debug.tool=gdb
seeed_xiao_nrf54l15.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
seeed_xiao_nrf54l15.debug.server.openocd.scripts.1=target/nrf54l15.cfg
seeed_xiao_nrf54l15.debug.cortex-debug.custom.request=attach
